package homework_24_04_08;

/*
Написать программу которая выводит текст в консоль,
поместить строку с выводом этого сообщения в отдельный метод.
 */

public class Main01 {

    public static void printText() {
        System.out.println("Hello procedural programming! ");
    }

    public static void main(String[] args) {
        printText();
    }
}
